-- ------------------------------------------------------------------------------------------------
-- ---------- 创建物品 ----------------------------------------------------------------------------
-- ------------------------------------------------------------------------------------------------

SIGen
.NewGroup( "others" )
.NewSubGroup( "icon-things" )
.NewItem( "icon-music" , 1000 ).AddFlags( SIFlags.itemFlags.hidden )
.NewItem( "icon-next" , 1000 ).AddFlags( SIFlags.itemFlags.hidden )

-- ------------------------------------------------------------------------------------------------
-- ---------- 创建界面 ----------------------------------------------------------------------------
-- ------------------------------------------------------------------------------------------------

SIGen.NewStyle( "view" ,
{
	type = "frame_style" ,
	parent = "frame" ,
	
	top_padding = 5 ,
	right_padding = 5 ,
	bottom_padding = 5 ,
	left_padding = 5 ,
	
	minimal_width = 50 ,
	minimal_height = 50 ,
	
	graphical_set =
	{
		newGUI = true ,
		base = { position = { 162 , 932 } , corner_size = 8 }
	}
} )